zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/dispatch/psa_crypto_driver_wrappers.h
}

static inline psa_status_t psa_driver_wrapper_cipher_set_iv(
    psa_cipher_operation_t *operation,
    const uint8_t *iv,
    size_t iv_length )
{
    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_CIPHER)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            return( mbedtls_psa_cipher_set_iv( &operation->ctx.mbedtls_ctx,
                                               iv,
                                               iv_length ) );
#endif /* MBEDTLS_PSA_BUILTIN_CIPHER */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
    case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


    status = mbedtls_test_transparent_cipher_set_iv
        (&operation->ctx.mbedtls_test_driver_ctx,
                        iv, iv_length
    );

    return status;

#endif
#if defined(PSA_CRYPTO_DRIVER_TEST) 
    case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


    status = mbedtls_test_transparent_cipher_set_iv
        (&operation->ctx.mbedtls_test_driver_ctx,
                        iv, iv_length
    );

    return status;

#endif


#if defined(STM32_HAL_PSA_AES_CIPHER_DRIVER_ENABLED) 
    case STM32_HAL_TRANSPARENT_DRIVER_ID:


    status = stm32_hal_transparent_cipher_set_iv
        (&operation->ctx.stm32_hal_driver_ctx,
                        iv, iv_length
    );

    return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */
    }

    (void)iv;
    (void)iv_length;

    (void) status;
    return( PSA_ERROR_INVALID_ARGUMENT );

}

static inline psa_status_t psa_driver_wrapper_cipher_update(
    psa_cipher_operation_t *operation,
    const uint8_t *input,
    size_t input_length,
    uint8_t *output,
    size_t output_size,
    size_t *output_length )
{
    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_CIPHER)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            return( mbedtls_psa_cipher_update( &operation->ctx.mbedtls_ctx,
                                               input,
                                               input_length,
                                               output,
                                               output_size,
                                               output_length ) );
#endif /* MBEDTLS_PSA_BUILTIN_CIPHER */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_cipher_update
            (&operation->ctx.mbedtls_test_driver_ctx,
                            input, input_length, output, output_size, output_length
        );

        return status;

#endif


#if defined(STM32_HAL_PSA_AES_CIPHER_DRIVER_ENABLED) 
        case STM32_HAL_TRANSPARENT_DRIVER_ID:


        status = stm32_hal_transparent_cipher_update
            (&operation->ctx.stm32_hal_driver_ctx,
                            input, input_length, output, output_size, output_length
        );

        return status;

#endif


#if defined(PSA_CRYPTO_DRIVER_TEST)
        case MBEDTLS_TEST_OPAQUE_DRIVER_ID:
            return( mbedtls_test_opaque_cipher_update(
                        &operation->ctx.opaque_test_driver_ctx,
                        input, input_length,
                        output, output_size, output_length ) );
#endif /* PSA_CRYPTO_DRIVER_TEST */
#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */
    }

    (void)input;
    (void)input_length;
    (void)output;
    (void)output_size;
    (void)output_length;

    (void) status;
    return( PSA_ERROR_INVALID_ARGUMENT );

}

static inline psa_status_t psa_driver_wrapper_cipher_finish(
    psa_cipher_operation_t *operation,
    uint8_t *output,
    size_t output_size,
    size_t *output_length )
{
    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_CIPHER)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            return( mbedtls_psa_cipher_finish( &operation->ctx.mbedtls_ctx,
                                               output,
                                               output_size,
                                               output_length ) );
#endif /* MBEDTLS_PSA_BUILTIN_CIPHER */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_cipher_finish
            (&operation->ctx.mbedtls_test_driver_ctx,
                            output, output_size, output_length
        );

        return status;

#endif


#if defined(STM32_HAL_PSA_AES_CIPHER_DRIVER_ENABLED) 
        case STM32_HAL_TRANSPARENT_DRIVER_ID:


        status = stm32_hal_transparent_cipher_finish
            (&operation->ctx.stm32_hal_driver_ctx,
                            output, output_size, output_length
        );

        return status;

#endif


#if defined(PSA_CRYPTO_DRIVER_TEST)
        case MBEDTLS_TEST_OPAQUE_DRIVER_ID:
            return( mbedtls_test_opaque_cipher_finish(
                        &operation->ctx.opaque_test_driver_ctx,
                        output, output_size, output_length ) );
#endif /* PSA_CRYPTO_DRIVER_TEST */
#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */
    }

    (void)output;
    (void)output_size;
    (void)output_length;

    (void) status;
    return( PSA_ERROR_INVALID_ARGUMENT );

}

static inline psa_status_t psa_driver_wrapper_cipher_abort(
    psa_cipher_operation_t *operation )
{

    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_CIPHER)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            return( mbedtls_psa_cipher_abort( &operation->ctx.mbedtls_ctx ) );
#endif /* MBEDTLS_PSA_BUILTIN_CIPHER */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_cipher_abort
            (&operation->ctx.mbedtls_test_driver_ctx
        );

