zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/dispatch/psa_crypto_driver_wrappers.h
        return status;

#endif


#if defined(STM32_HAL_PSA_AES_CIPHER_DRIVER_ENABLED) 
        case STM32_HAL_TRANSPARENT_DRIVER_ID:


        status = stm32_hal_transparent_cipher_abort
            (&operation->ctx.stm32_hal_driver_ctx
        );

        return status;

#endif


#if defined(PSA_CRYPTO_DRIVER_TEST)
        case MBEDTLS_TEST_OPAQUE_DRIVER_ID:
            status = mbedtls_test_opaque_cipher_abort(
                         &operation->ctx.opaque_test_driver_ctx );
            mbedtls_platform_zeroize(
                &operation->ctx.opaque_test_driver_ctx,
                sizeof( operation->ctx.opaque_test_driver_ctx ) );
            return( status );
#endif /* PSA_CRYPTO_DRIVER_TEST */
#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */
    }

    (void)status;
    return( PSA_ERROR_INVALID_ARGUMENT );

}

/*
 * Hashing functions
 */
static inline psa_status_t psa_driver_wrapper_hash_compute(
    psa_algorithm_t alg,
    const uint8_t *input,
    size_t input_length,
    uint8_t *hash,
    size_t hash_size,
    size_t *hash_length)
{

    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    /* Try accelerators first */
#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 


    status = mbedtls_test_transparent_hash_compute
        (alg, input, input_length, hash, hash_size, hash_length
    );

    if(status != PSA_ERROR_NOT_SUPPORTED)
        return status;

#endif


#if defined(STM32_HAL_PSA_HASH_DRIVER_ENABLED) 


    status = stm32_hal_transparent_hash_compute
        (alg, input, input_length, hash, hash_size, hash_length
    );

    if(status != PSA_ERROR_NOT_SUPPORTED)
        return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */

    /* If software fallback is compiled in, try fallback */
#if defined(MBEDTLS_PSA_BUILTIN_HASH)
    status = mbedtls_psa_hash_compute( alg, input, input_length,
                                       hash, hash_size, hash_length );
    if( status != PSA_ERROR_NOT_SUPPORTED )
        return( status );
#endif
    (void) status;
    (void) alg;
    (void) input;
    (void) input_length;
    (void) hash;
    (void) hash_size;
    (void) hash_length;

    return( PSA_ERROR_NOT_SUPPORTED );

}

static inline psa_status_t psa_driver_wrapper_hash_setup(
    psa_hash_operation_t *operation,
    psa_algorithm_t alg )
{

    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    /* Try setup on accelerators first */
#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 


    status = mbedtls_test_transparent_hash_setup
        (&operation->ctx.mbedtls_test_driver_ctx, alg
    );
    if(status == PSA_SUCCESS)
        operation->id = MBEDTLS_TEST_TRANSPARENT_DRIVER_ID;

    if(status != PSA_ERROR_NOT_SUPPORTED)
        return status;

#endif


#if defined(STM32_HAL_PSA_HASH_DRIVER_ENABLED) 


    status = stm32_hal_transparent_hash_setup
        (&operation->ctx.stm32_hal_driver_ctx, alg
    );
    if(status == PSA_SUCCESS)
        operation->id = STM32_HAL_TRANSPARENT_DRIVER_ID;

    if(status != PSA_ERROR_NOT_SUPPORTED)
        return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */

    /* If software fallback is compiled in, try fallback */
#if defined(MBEDTLS_PSA_BUILTIN_HASH)
    status = mbedtls_psa_hash_setup( &operation->ctx.mbedtls_ctx, alg );
    if( status == PSA_SUCCESS )
        operation->id = PSA_CRYPTO_MBED_TLS_DRIVER_ID;

    if( status != PSA_ERROR_NOT_SUPPORTED )
        return( status );
#endif
    /* Nothing left to try if we fall through here */
    (void) status;
    (void) operation;
    (void) alg;
    return( PSA_ERROR_NOT_SUPPORTED );

}

static inline psa_status_t psa_driver_wrapper_hash_clone(
    const psa_hash_operation_t *source_operation,
    psa_hash_operation_t *target_operation )
{

    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;
    switch( source_operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_HASH)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            target_operation->id = PSA_CRYPTO_MBED_TLS_DRIVER_ID;
            return( mbedtls_psa_hash_clone( &source_operation->ctx.mbedtls_ctx,
                                            &target_operation->ctx.mbedtls_ctx ) );
#endif
#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:

        target_operation->id = MBEDTLS_TEST_TRANSPARENT_DRIVER_ID;

        status = mbedtls_test_transparent_hash_clone
            (&source_operation->ctx.mbedtls_test_driver_ctx, &target_operation->ctx.mbedtls_test_driver_ctx
        );

        return status;

#endif


#if defined(STM32_HAL_PSA_HASH_DRIVER_ENABLED) 
        case STM32_HAL_TRANSPARENT_DRIVER_ID:

        target_operation->id = STM32_HAL_TRANSPARENT_DRIVER_ID;

        status = stm32_hal_transparent_hash_clone
            (&source_operation->ctx.stm32_hal_driver_ctx, &target_operation->ctx.stm32_hal_driver_ctx
        );

        return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */
        default:
            (void) status;
            (void) target_operation;
            return( PSA_ERROR_BAD_STATE );
    }

}

static inline psa_status_t psa_driver_wrapper_hash_update(
    psa_hash_operation_t *operation,
    const uint8_t *input,
    size_t input_length )
{

    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;
    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_HASH)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            return( mbedtls_psa_hash_update( &operation->ctx.mbedtls_ctx,
                                             input, input_length ) );
#endif
#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_hash_update
            (&operation->ctx.mbedtls_test_driver_ctx, input, input_length
        );

        return status;

#endif


#if defined(STM32_HAL_PSA_HASH_DRIVER_ENABLED) 
        case STM32_HAL_TRANSPARENT_DRIVER_ID:


