zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/dispatch/psa_crypto_driver_wrappers.h
/*
 * AEAD functions
 */
static inline psa_status_t psa_driver_wrapper_aead_encrypt(
    const psa_key_attributes_t *attributes,
    const uint8_t *key_buffer, size_t key_buffer_size,
    psa_algorithm_t alg,
    const uint8_t *nonce, size_t nonce_length,
    const uint8_t *additional_data, size_t additional_data_length,
    const uint8_t *plaintext, size_t plaintext_length,
    uint8_t *ciphertext, size_t ciphertext_size, size_t *ciphertext_length )
{

    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;
    psa_key_location_t location =
        PSA_KEY_LIFETIME_GET_LOCATION( psa_get_key_lifetime(attributes) );

    switch( location )
    {
        case PSA_KEY_LOCATION_LOCAL_STORAGE:
            /* Key is stored in the slot in export representation, so
             * cycle through all known transparent accelerators */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 


    status = mbedtls_test_transparent_aead_encrypt
        (attributes, key_buffer, key_buffer_size, alg, nonce, nonce_length,
                        additional_data, additional_data_length, plaintext, plaintext_length,
                        ciphertext, ciphertext_size, ciphertext_length
    );

    if(status != PSA_ERROR_NOT_SUPPORTED)
        return status;

#endif


#if defined(STM32_HAL_PSA_AES_AEAD_DRIVER_ENABLED) 


    status = stm32_hal_transparent_aead_encrypt
        (attributes, key_buffer, key_buffer_size, alg, nonce, nonce_length,
                        additional_data, additional_data_length, plaintext, plaintext_length,
                        ciphertext, ciphertext_size, ciphertext_length
    );

    if(status != PSA_ERROR_NOT_SUPPORTED)
        return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */

            /* Fell through, meaning no accelerator supports this operation */
#if defined(MBEDTLS_PSA_BUILTIN_AEAD)
            return( mbedtls_psa_aead_encrypt(
                        attributes, key_buffer, key_buffer_size,
                        alg,
                        nonce, nonce_length,
                        additional_data, additional_data_length,
                        plaintext, plaintext_length,
                        ciphertext, ciphertext_size, ciphertext_length ) );
#else
            return( PSA_ERROR_NOT_SUPPORTED );
#endif

        /* Add cases for opaque driver here */

        default:
            /* Key is declared with a lifetime not known to us */
            (void)status;
            (void) key_buffer; (void) key_buffer_size;
            (void) alg;
            (void) nonce; (void) nonce_length;
            (void) additional_data; (void) additional_data_length;
            (void) plaintext; (void) plaintext_length;
            (void) ciphertext; (void) ciphertext_size; (void) ciphertext_length;
            return( PSA_ERROR_INVALID_ARGUMENT );
    }

}

static inline psa_status_t psa_driver_wrapper_aead_decrypt(
    const psa_key_attributes_t *attributes,
    const uint8_t *key_buffer, size_t key_buffer_size,
    psa_algorithm_t alg,
    const uint8_t *nonce, size_t nonce_length,
    const uint8_t *additional_data, size_t additional_data_length,
    const uint8_t *ciphertext, size_t ciphertext_length,
    uint8_t *plaintext, size_t plaintext_size, size_t *plaintext_length )
{

    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;
    psa_key_location_t location =
        PSA_KEY_LIFETIME_GET_LOCATION( psa_get_key_lifetime(attributes) );

    switch( location )
    {
        case PSA_KEY_LOCATION_LOCAL_STORAGE:
            /* Key is stored in the slot in export representation, so
             * cycle through all known transparent accelerators */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 


    status = mbedtls_test_transparent_aead_decrypt
        (attributes, key_buffer, key_buffer_size, alg, nonce, nonce_length,
                        additional_data, additional_data_length, ciphertext, ciphertext_length,
                        plaintext, plaintext_size, plaintext_length
    );

    if(status != PSA_ERROR_NOT_SUPPORTED)
        return status;

#endif


#if defined(STM32_HAL_PSA_AES_AEAD_DRIVER_ENABLED) 


    status = stm32_hal_transparent_aead_decrypt
        (attributes, key_buffer, key_buffer_size, alg, nonce, nonce_length,
                        additional_data, additional_data_length, ciphertext, ciphertext_length,
                        plaintext, plaintext_size, plaintext_length
    );

    if(status != PSA_ERROR_NOT_SUPPORTED)
        return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */

            /* Fell through, meaning no accelerator supports this operation */
#if defined(MBEDTLS_PSA_BUILTIN_AEAD)
            return( mbedtls_psa_aead_decrypt(
                        attributes, key_buffer, key_buffer_size,
                        alg,
                        nonce, nonce_length,
                        additional_data, additional_data_length,
                        ciphertext, ciphertext_length,
                        plaintext, plaintext_size, plaintext_length ) );
#else
            return( PSA_ERROR_NOT_SUPPORTED );
#endif

        /* Add cases for opaque driver here */

        default:
            /* Key is declared with a lifetime not known to us */
            (void)status;
            (void) key_buffer; (void) key_buffer_size;
            (void) alg;
            (void) nonce; (void) nonce_length;
            (void) additional_data; (void) additional_data_length;
            (void) ciphertext; (void) ciphertext_length;
            (void) plaintext; (void) plaintext_size; (void) plaintext_length;
            return( PSA_ERROR_INVALID_ARGUMENT );
    }

}

static inline psa_status_t psa_driver_wrapper_aead_encrypt_setup(
   psa_aead_operation_t *operation,
   const psa_key_attributes_t *attributes,
   const uint8_t *key_buffer, size_t key_buffer_size,
   psa_algorithm_t alg )
{

    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;
    psa_key_location_t location =
        PSA_KEY_LIFETIME_GET_LOCATION( psa_get_key_lifetime(attributes) );

    switch( location )
    {
        case PSA_KEY_LOCATION_LOCAL_STORAGE:
            /* Key is stored in the slot in export representation, so
             * cycle through all known transparent accelerators */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

