zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/dispatch/psa_crypto_driver_wrappers.h
#if defined(PSA_CRYPTO_DRIVER_TEST) 


        status = mbedtls_test_transparent_aead_encrypt_setup
            (&operation->ctx.mbedtls_test_driver_ctx,
                            attributes, key_buffer, key_buffer_size, alg
        );
        if(status == PSA_SUCCESS)
            operation->id = MBEDTLS_TEST_TRANSPARENT_DRIVER_ID;

        if(status != PSA_ERROR_NOT_SUPPORTED)
            return status;

#endif


#if defined(STM32_HAL_PSA_AES_AEAD_DRIVER_ENABLED) 


        status = stm32_hal_transparent_aead_encrypt_setup
            (&operation->ctx.stm32_hal_driver_ctx,
                            attributes, key_buffer, key_buffer_size, alg
        );
        if(status == PSA_SUCCESS)
            operation->id = STM32_HAL_TRANSPARENT_DRIVER_ID;

        if(status != PSA_ERROR_NOT_SUPPORTED)
            return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */

            /* Fell through, meaning no accelerator supports this operation */
#if defined(MBEDTLS_PSA_BUILTIN_AEAD)
            operation->id = PSA_CRYPTO_MBED_TLS_DRIVER_ID;
            status = mbedtls_psa_aead_encrypt_setup(
                        &operation->ctx.mbedtls_ctx, attributes,
                        key_buffer, key_buffer_size,
                        alg );
            return( status );
#else
            return( PSA_ERROR_NOT_SUPPORTED );
#endif

        /* Add cases for opaque driver here */

        default:
            /* Key is declared with a lifetime not known to us */
            (void)status;
            (void) operation;
            (void) key_buffer; (void) key_buffer_size;
            (void) alg;
            return( PSA_ERROR_INVALID_ARGUMENT );
    }

}

static inline psa_status_t psa_driver_wrapper_aead_decrypt_setup(
   psa_aead_operation_t *operation,
   const psa_key_attributes_t *attributes,
   const uint8_t *key_buffer, size_t key_buffer_size,
   psa_algorithm_t alg )
{

    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;
    psa_key_location_t location =
        PSA_KEY_LIFETIME_GET_LOCATION( psa_get_key_lifetime(attributes) );

    switch( location )
    {
        case PSA_KEY_LOCATION_LOCAL_STORAGE:
            /* Key is stored in the slot in export representation, so
             * cycle through all known transparent accelerators */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 


        status = mbedtls_test_transparent_aead_decrypt_setup
            (&operation->ctx.mbedtls_test_driver_ctx,
                            attributes, key_buffer, key_buffer_size, alg
        );
        if(status == PSA_SUCCESS)
            operation->id = MBEDTLS_TEST_TRANSPARENT_DRIVER_ID;

        if(status != PSA_ERROR_NOT_SUPPORTED)
            return status;

#endif


#if defined(STM32_HAL_PSA_AES_AEAD_DRIVER_ENABLED) 


        status = stm32_hal_transparent_aead_decrypt_setup
            (&operation->ctx.stm32_hal_driver_ctx,
                            attributes, key_buffer, key_buffer_size, alg
        );
        if(status == PSA_SUCCESS)
            operation->id = STM32_HAL_TRANSPARENT_DRIVER_ID;

        if(status != PSA_ERROR_NOT_SUPPORTED)
            return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */

            /* Fell through, meaning no accelerator supports this operation */
#if defined(MBEDTLS_PSA_BUILTIN_AEAD)
            operation->id = PSA_CRYPTO_MBED_TLS_DRIVER_ID;
            status = mbedtls_psa_aead_decrypt_setup(
                        &operation->ctx.mbedtls_ctx,
                        attributes,
                        key_buffer, key_buffer_size,
                        alg );
            return( status );
#else
            return( PSA_ERROR_NOT_SUPPORTED );
#endif
        /* Add cases for opaque driver here */

        default:
            /* Key is declared with a lifetime not known to us */
            (void)status;
            (void) operation;
            (void) key_buffer; (void)key_buffer_size;
            (void) alg;
            return( PSA_ERROR_INVALID_ARGUMENT );
    }

}

static inline psa_status_t psa_driver_wrapper_aead_set_nonce(
   psa_aead_operation_t *operation,
   const uint8_t *nonce,
   size_t nonce_length )
{
    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_AEAD)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            return( mbedtls_psa_aead_set_nonce( &operation->ctx.mbedtls_ctx,
                                                nonce,
                                                nonce_length ) );

#endif /* MBEDTLS_PSA_BUILTIN_AEAD */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_aead_set_nonce
            (&operation->ctx.mbedtls_test_driver_ctx,
                            nonce, nonce_length
        );

        return status;

#endif
#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_aead_set_nonce
            (&operation->ctx.mbedtls_test_driver_ctx,
                            nonce, nonce_length
        );

        return status;

#endif


#if defined(STM32_HAL_PSA_AES_AEAD_DRIVER_ENABLED) 
        case STM32_HAL_TRANSPARENT_DRIVER_ID:


        status = stm32_hal_transparent_aead_set_nonce
            (&operation->ctx.stm32_hal_driver_ctx,
                            nonce, nonce_length
        );

        return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */
    }

    (void)nonce;
    (void)nonce_length;

    (void) status;
    return( PSA_ERROR_INVALID_ARGUMENT );

}

static inline psa_status_t psa_driver_wrapper_aead_set_lengths(
   psa_aead_operation_t *operation,
   size_t ad_length,
   size_t plaintext_length )
{
    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_AEAD)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            return( mbedtls_psa_aead_set_lengths( &operation->ctx.mbedtls_ctx,
                                                  ad_length,
                                                  plaintext_length ) );

