zephyrproject-rtos/hal_stm32/lib/stm32_psa_crypto_drivers/dispatch/psa_crypto_driver_wrappers.h
#endif /* MBEDTLS_PSA_BUILTIN_AEAD */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_aead_set_lengths
            (&operation->ctx.mbedtls_test_driver_ctx,
                            ad_length, plaintext_length
        );

        return status;

#endif
#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_aead_set_lengths
            (&operation->ctx.mbedtls_test_driver_ctx,
                            ad_length, plaintext_length
        );

        return status;

#endif


#if defined(STM32_HAL_PSA_AES_AEAD_DRIVER_ENABLED) 
        case STM32_HAL_TRANSPARENT_DRIVER_ID:


        status = stm32_hal_transparent_aead_set_lengths
            (&operation->ctx.stm32_hal_driver_ctx,
                            ad_length, plaintext_length
        );

        return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */
    }

    (void)ad_length;
    (void)plaintext_length;

    (void) status;
    return( PSA_ERROR_INVALID_ARGUMENT );

}

static inline psa_status_t psa_driver_wrapper_aead_update_ad(
   psa_aead_operation_t *operation,
   const uint8_t *input,
   size_t input_length )
{
    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_AEAD)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            return( mbedtls_psa_aead_update_ad( &operation->ctx.mbedtls_ctx,
                                                input,
                                                input_length ) );

#endif /* MBEDTLS_PSA_BUILTIN_AEAD */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_aead_update_ad
            (&operation->ctx.mbedtls_test_driver_ctx,
                            input, input_length
        );

        return status;

#endif


#if defined(STM32_HAL_PSA_AES_AEAD_DRIVER_ENABLED) 
        case STM32_HAL_TRANSPARENT_DRIVER_ID:


        status = stm32_hal_transparent_aead_update_ad
            (&operation->ctx.stm32_hal_driver_ctx,
                            input, input_length
        );

        return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */
    }

    (void)input;
    (void)input_length;

    (void) status;
    return( PSA_ERROR_INVALID_ARGUMENT );

}

static inline psa_status_t psa_driver_wrapper_aead_update(
   psa_aead_operation_t *operation,
   const uint8_t *input,
   size_t input_length,
   uint8_t *output,
   size_t output_size,
   size_t *output_length )
{
    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_AEAD)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            return( mbedtls_psa_aead_update( &operation->ctx.mbedtls_ctx,
                                             input, input_length,
                                             output, output_size,
                                             output_length ) );

#endif /* MBEDTLS_PSA_BUILTIN_AEAD */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_aead_update
            (&operation->ctx.mbedtls_test_driver_ctx,
                            input, input_length, output, output_size, output_length
        );

        return status;

#endif


#if defined(STM32_HAL_PSA_AES_AEAD_DRIVER_ENABLED) 
        case STM32_HAL_TRANSPARENT_DRIVER_ID:


        status = stm32_hal_transparent_aead_update
            (&operation->ctx.stm32_hal_driver_ctx,
                            input, input_length, output, output_size, output_length
        );

        return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */
    }

    (void)input;
    (void)input_length;
    (void)output;
    (void)output_size;
    (void)output_length;

    (void) status;
    return( PSA_ERROR_INVALID_ARGUMENT );

}

static inline psa_status_t psa_driver_wrapper_aead_finish(
   psa_aead_operation_t *operation,
   uint8_t *ciphertext,
   size_t ciphertext_size,
   size_t *ciphertext_length,
   uint8_t *tag,
   size_t tag_size,
   size_t *tag_length )
{
    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_AEAD)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            return( mbedtls_psa_aead_finish( &operation->ctx.mbedtls_ctx,
                                             ciphertext,
                                             ciphertext_size,
                                             ciphertext_length, tag,
                                             tag_size, tag_length ) );

#endif /* MBEDTLS_PSA_BUILTIN_AEAD */

#if defined(PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT)

#if defined(PSA_CRYPTO_DRIVER_TEST) 
        case MBEDTLS_TEST_TRANSPARENT_DRIVER_ID:


        status = mbedtls_test_transparent_aead_finish
            (&operation->ctx.mbedtls_test_driver_ctx,
                            ciphertext, ciphertext_size, ciphertext_length, tag, tag_size, tag_length
        );

        return status;

#endif


#if defined(STM32_HAL_PSA_AES_AEAD_DRIVER_ENABLED) 
        case STM32_HAL_TRANSPARENT_DRIVER_ID:


        status = stm32_hal_transparent_aead_finish
            (&operation->ctx.stm32_hal_driver_ctx,
                            ciphertext, ciphertext_size, ciphertext_length, tag, tag_size, tag_length
        );

        return status;

#endif


#endif /* PSA_CRYPTO_ACCELERATOR_DRIVER_PRESENT */
    }

    (void)ciphertext;
    (void)ciphertext_size;
    (void)ciphertext_length;
    (void)tag;
    (void)tag_size;
    (void)tag_length;

    (void) status;
    return( PSA_ERROR_INVALID_ARGUMENT );

}

static inline psa_status_t psa_driver_wrapper_aead_verify(
   psa_aead_operation_t *operation,
   uint8_t *plaintext,
   size_t plaintext_size,
   size_t *plaintext_length,
   const uint8_t *tag,
   size_t tag_length )
{
    psa_status_t status = PSA_ERROR_CORRUPTION_DETECTED;

    switch( operation->id )
    {
#if defined(MBEDTLS_PSA_BUILTIN_AEAD)
        case PSA_CRYPTO_MBED_TLS_DRIVER_ID:
            {
                uint8_t check_tag[PSA_AEAD_TAG_MAX_SIZE];
                size_t check_tag_length;

